<a href="https://colab.research.google.com/github/sanjana1391/Sanjana-DAML-2021-22/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**PANDAS**

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'1.1.5'

In [3]:
#dictionary

data={'student':['jack','jill','damon'], 'year':[1,2,3,]}

In [4]:
df= pd.DataFrame(data)
df

  student  year
0    jack     1
1    jill     2
2   damon     3

In [5]:
type (df['student'])

pandas.core.series.Series

In [6]:
#to load different data 
df=pd.read_csv('/content/sample_data/california_housing_train.csv')

In [7]:
df

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

In [8]:
df.axes

[RangeIndex(start=0, stop=17000, step=1),
 Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
        'total_bedrooms', 'population', 'households', 'median_income',
        'median_house_value'],
       dtype='object')]

In [9]:
df.axes[1]

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

In [10]:
df.longitude

0       -114.31
1       -114.47
2       -114.56
3       -114.57
4       -114.57
          ...
16995   -124.26
16996   -124.27
16997   -124.30
16998   -124.30
16999   -124.35
Name: longitude, Length: 17000, dtype: float64

In [13]:
df['longitude']

0       -114.31
1       -114.47
2       -114.56
3       -114.57
4       -114.57
          ...
16995   -124.26
16996   -124.27
16997   -124.30
16998   -124.30
16999   -124.35
Name: longitude, Length: 17000, dtype: float64

In [14]:
df.rank

<bound method NDFrame.rank of        longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]>

In [20]:
df.iloc[1:4]

   longitude  latitude  ...  median_income  median_house_value
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0

[3 rows x 9 columns]

In [21]:
df.iloc[1:3,0:1]

   longitude
1    -114.47
2    -114.56

In [22]:
df.iloc[:,2:]

       housing_median_age  total_rooms  ...  median_income  median_house_value
0                    15.0       5612.0  ...         1.4936             66900.0
1                    19.0       7650.0  ...         1.8200             80100.0
2                    17.0        720.0  ...         1.6509             85700.0
3                    14.0       1501.0  ...         3.1917             73400.0
4                    20.0       1454.0  ...         1.9250             65500.0
...                   ...          ...  ...            ...                 ...
16995                52.0       2217.0  ...         2.3571            111400.0
16996                36.0       2349.0  ...         2.5179             79000.0
16997                17.0       2677.0  ...         3.0313            103600.0
16998                19.0       2672.0  ...         1.9797             85800.0
16999                52.0       1820.0  ...         3.0147             94600.0

[17000 rows x 7 columns]

fancy indexing

In [25]:
df.loc[:,['longitude','households']]

       longitude  households
0        -114.31       472.0
1        -114.47       463.0
2        -114.56       117.0
3        -114.57       226.0
4        -114.57       262.0
...          ...         ...
16995    -124.26       369.0
16996    -124.27       465.0
16997    -124.30       456.0
16998    -124.30       478.0
16999    -124.35       270.0

[17000 rows x 2 columns]

In [26]:
df.loc[0:2,['longitude','households']]

   longitude  households
0    -114.31       472.0
1    -114.47       463.0
2    -114.56       117.0

In [29]:
df.loc[0:2,'longitude':'households']

   longitude  latitude  ...  population  households
0    -114.31     34.19  ...      1015.0       472.0
1    -114.47     34.40  ...      1129.0       463.0
2    -114.56     33.69  ...       333.0       117.0

[3 rows x 7 columns]


last given index is not included in iloc

series

1.   row
2.   fetching

---

last given index is  included in loc


1.   column
2.   machine learning